                                                        BANCO DE DADOS

In [1]:
import sqlite3
import pandas as pd

In [5]:
conn = sqlite3.connect('coderhouse.db')

In [6]:
df = pd.read_excel('fastfood.xlsx')

In [7]:
df.head(2)

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Mcdonalds,Artisan Grilled Chicken Sandwich,380,60,7,2,0,95,1110,44,3.0,11,37.0,4.0,20.0,20.0,Other
1,Mcdonalds,Single Bacon Smokehouse Burger,840,410,45,17,2023-05-01 00:00:00,130,1580,62,2.0,18,46.0,6.0,20.0,20.0,Other

In [8]:
df.to_sql('fastfood', conn,if_exists='replace',index=False) #SALVAR A TABELA DATA FRAME FASTFOOD AO BANCO DE DADOS CODERHOUSE

515

In [40]:
#PUXAR INFO DO BANCO DE DADOS

query = 'select calories from fastfood'
df = pd.read_sql(query, conn)

In [11]:
df.head(4)

   calories
0       380
1       840
2      1130
3       750

In [12]:
query = 'select * from fastfood' #O * PUXA TODAS AS INFORMACOES DA TABELA
df = pd.read_sql(query, conn)

In [14]:
df.head(2)

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Mcdonalds,Artisan Grilled Chicken Sandwich,380,60,7,2,0,95,1110,44,3.0,11,37.0,4.0,20.0,20.0,Other
1,Mcdonalds,Single Bacon Smokehouse Burger,840,410,45,17,2023-05-01 00:00:00,130,1580,62,2.0,18,46.0,6.0,20.0,20.0,Other

In [17]:
query = 'select * from fastfood where calories <= 25' #O * PUXA TODAS AS INFORMACOES DA TABELA
df = pd.read_sql(query, conn)

In [18]:
df

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Dairy Queen,Side Salad,20,0,0,0,0,0,15,5,2.0,3,1.0,50.0,30.0,15.0,Other

In [19]:
conn.close()

LISTAR AS TABELAS QUE TEM NO BANCO DE DADOS

In [28]:
conn = sqlite3.connect('coderhouse.db')

In [24]:
query = "SELECT name FROM sqlite_master WHERE type='table'" #selecione o nome da sqlitmaster onde tipo == table
schema = pd.read_sql_query(query, conn)

In [26]:
print(schema) #LISTOU TODAS AS TABELAS QUE TEM NO BANCO CODERHOUSE

       name
0  produtos
1  fastfood

In [27]:
conn.close()

In [7]:
query = "SELECT * FROM sqlite_master WHERE type='table'" #selecione tudo da sqlitmaster onde tipo == table
schema = pd.read_sql_query(query, conn)

In [8]:
schema

,type,name,tbl_name,rootpage,sql
0,table,produtos,produtos,2,"CREATE TABLE ""produtos"" (\n""nome"" TEXT,\n ""va..."
1,table,fastfood,fastfood,3,"CREATE TABLE ""fastfood"" (\n""restaurant"" TEXT,\..."

In [31]:
conn.close()

In [2]:
conn = sqlite3.connect('coderhouse.db')

In [5]:
query = 'select * from produtos'
df = pd.read_sql(query, conn)
df

       nome  valor
0      ovos     10
1  manteiga     20
2     peixe     30